print("введите значение первого элемента прогрессии b в значениях -10000<=b<=10000")
b=float(input())
print("введите значение множителя прогрессии q в значениях 1<=q<=50")
q=float(input())
print("введите номер последнего элемента прогрессии n в значениях 2<=n<=100")
n=float(input())
if b>=-10000 and b<=10000:
    if q>=1 and q<=50:
        if n>=2 and n<=100:
            k=b*(1-q**n)/(1-q)
            print("геометрическая прогрессия",k)
        else: print("число не подходит")    
    elif q==1:
        if n>=2 and n<=50:
            k=b*n
            print("геометрическая прогрессия",k)
        else: print("число не подходит")      
    else: print("число не подходит")  
else: print("число не подходит")      