print("введите значение числа n в значениях 1<=n<=100000")
n = int(input())
# Проверяем n
if n >= 1 and n <= 100000:
    # Сохраняем начальное число для проверки на простоту
    p = n
    k = 0
    # Считаем операции
    while n > 0:
        n = n - 3
        k = k + 1 
    print("количество операций:", k)
    # определяем простоту p и вводим pr. если pr=1 то число простое,0-составное
    pr=1
    for i in range(2, p):
        if p % i == 0:
             pr=0
        break
    if pr==1: print("число простое")
    else: print("число составное")    
else:
    print("число не подходит")